"""
Задача 2: 
Найдите сумму цифр трехзначного числа. 
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
"""

n = int(input("Введите число: "))
sum = 0
temp = n
while(temp > 0):
    sum += temp % 10
    temp //= 10
print(f"Сумма цифр числа {n} -> {sum}")
