# Задача №21. 
# Решение в группах
# Напишите программу для печати всех уникальных
# значений в словаре.

# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# Примечание: Список словарей задан изначально.
# Пользователь его не вводит

dictionari = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": "S005"}, {"V": "S009"}, {"VIII": "S007"}]
sets = set()
# проходим по каждому словарю в списке
for (i) in dictionari:
    # проходим по каждому значению в словаре
    for(k,v) in i.items():
        sets.add(v)
        # sets.add(v.strip()) - .strip() убирает пробелы и табуляции в строках. Например {"VI": " S005"}, {"VII": "S005 "}
print(sets)


# Вариант решения в одну строку
dc = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]
print({list(i.values())[0].strip() for i in dc}) #

